package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("12 12 2018");
    }
}
/* 34%, 1, 1.78, 55455 */